package greedy

// p455 分发饼干
// 假设你是一位家长，给两个数组：g 和 s。
// g[i] 是第 i 个孩子所需的最小饼干大小，s[i] 是第 i 个饼干的尺寸。
// 如果第 i 个饼干的尺寸 s[i] >= g[i]，则可以将饼干分配给孩子。
// 每个孩子最多只能分配一块饼干。
// 请你计算满足所有孩子的情况下，最多能分配多少个孩子。
//
// 示例 1：
// 输入：g = [1, 2, 3], s = [1, 1]
// 输出：1
// 解释：你有 2 个饼干，尺寸为 1 和 1。
// 孩子 1 需要的最小饼干大小是 1，孩子 2 需要 2，孩子 3 需要 3。
// 饼干尺寸 1 可以满足孩子 1，所以最多满足 1 个孩子。
//
// 提示：
// - 1 <= g.length <= 3 * 10^4
// - 1 <= s.length <= 3 * 10^4
// - 1 <= g[i], s[i] <= 2^31 - 1

func findContentChildren(g []int, s []int) int {

}
