package binarysearch

// p278 第一个错误的版本
// 你是产品经理，目前正在带领团队开发一个新的产品。
// 不幸的是，产品的最新版本无法通过质量检测。
// 由于每个版本都是基于上一个版本开发的，所以错误的版本之后的所有版本都是错误的。
//
// 假设你有 n 个版本 [1, 2, ..., n]，你需要找出第一个错误的版本，
// 从而停止在这些版本上继续开发。
// 定义一个辅助函数 isBadVersion(version)，
// 用于检测版本 version 是否有错误。
// 如果版本为坏版本则返回 true，否则返回 false。
//
// 当函数被调用时，如果发现版本为坏版本，将停止开发。
// 请找出第一个导致质量检测失败的版本。
//
// 示例 1：
// 输入：n = 5, bad = 4
// 输出：4
// 解释：
// 调用 isBadVersion(4) 返回 true
// 调用 isBadVersion(3) 返回 false
// 所以 4 是第一个错误的版本。
//
// 提示：
// - 1 <= bad <= n <= 2^31 - 1

func firstBadVersion(n int) int {

}
